## Creating Tables with SQLAlchemy
Previously, you used the `Table` object to reflect a table from an existing database, but what if you wanted to create a new table? You'd still use the `Table` object; however, you'd need to replace the `autoload` and `autoload_with` parameters with Column objects.

The `Column` object takes a name, a SQLAlchemy type with an optional format, and optional keyword arguments for different constraints.

When defining the table, recall how in the video Jason passed in `255` as the maximum length of a String by using `Column('name', String(255))`. Checking out the slides from the video may help: you can download them by clicking on 'Slides' next to the IPython Shell.

After defining the table, you can create the table in the database by using the `.create_all()` method on metadata and supplying the engine as the only parameter. Go for it!

In [1]:
import pandas as pd
def get_df_select_stmt(conn, select_stmt):
    # Results of executing the select_stmt
    results = conn.execute(select_stmt).fetchall()

    # Create a DataFrame from the results: df
    df = pd.DataFrame(results)

    # Set column names
    df.columns = results[0].keys()
    
    return df

In [2]:
# Import create_engine
from sqlalchemy import create_engine, MetaData

# Metadata
metadata = MetaData()

# Create an engine that connects to the census.sqlite file: engine
engine = create_engine('sqlite:///employees.sqlite')

# create connection
connection = engine.connect()

# Print table names
print(engine.table_names())

['employees']

In [3]:
# Import Table, Column, String, Integer, Float, Boolean from sqlalchemy
from sqlalchemy import Table, Column, String, Integer, Float, Boolean

# Define a new table with a name, count, amount, and valid column: data
data = Table('data', metadata,
             Column('name', String(255), unique=True),
             Column('count', Integer(), default=1),
             Column('amount', Float()),
             Column('valid', Boolean(), default=False)
)

# Define census table
census = Table('census', metadata,
             Column('state', String(100)),
             Column('sex', String(1)),
             Column('age', Integer()),
             Column('pop2000', Integer()),
             Column('pop2008', Integer())
)

# Use the metadata to create the table
metadata.create_all(engine)

In [4]:
# Print table details
print(repr(data))

Table('data', MetaData(bind=None), Column('name', String(length=255), table=<data>), Column('count', Integer(), table=<data>, default=ColumnDefault(1)), Column('amount', Float(), table=<data>), Column('valid', Boolean(), table=<data>, default=ColumnDefault(False)), schema=None)

In [5]:
# Print table names
print(engine.table_names())

['census', 'data', 'employees']

In [6]:
# Print the table details
print(repr(metadata.tables['data']))

Table('data', MetaData(bind=None), Column('name', String(length=255), table=<data>), Column('count', Integer(), table=<data>, default=ColumnDefault(1)), Column('amount', Float(), table=<data>), Column('valid', Boolean(), table=<data>, default=ColumnDefault(False)), schema=None)

## Inserting a single row with an insert() statement
There are several ways to perform an insert with SQLAlchemy; however, we are going to focus on the one that follows the same pattern as the `select` statement.

It uses an `insert` statement where you specify the table as an argument, and supply the data you wish to insert into the value via the `.values()` method as keyword arguments.

In [7]:
# Import insert and select from sqlalchemy
from sqlalchemy import insert, select

# Build an insert statement to insert a record into the data table: stmt
stmt = insert(data).values(name='Anna', count=1, amount=1000.00, valid=True)

# Execute the statement via the connection: results
results = connection.execute(stmt)

# Print result rowcount
print(results.rowcount)

1

In [8]:
# Build a select statement to validate the insert
stmt = select([data]).where(data.columns.name == 'Anna')

# Print the result of executing the query.
print(connection.execute(stmt).first())

('Anna', 1, 1000.0, True)

## Inserting Multiple Records at Once
It's time to practice inserting multiple records at once!

As Jason showed you in the video, you'll want to first build a list of dictionaries that represents the data you want to insert. Then, in the `.execute()` method, you can pair this list of dictionaries with an insert statement, which will `insert` all the records in your list of dictionaries.

In [9]:
# Build a list of dictionaries: values_list
values_list = [
    {'name': 'Ana', 'count': 1, 'amount': 1000.00, 'valid': True},
    {'name': 'Taylor', 'count': 1, 'amount': 750.00, 'valid': False}
]

# Build an insert statement for the data table: stmt
stmt = insert(data)

# Execute stmt with the values_list: results
results = connection.execute(stmt, values_list)

# Print rowcount
print(results.rowcount)

2

In [10]:
# Build a select statement to validate the insert
stmt = select([data])

# Print the result of executing the query.
df = get_df_select_stmt(connection, stmt)
df.head()

     name  count  amount  valid
0    Anna      1  1000.0   True
1     Ana      1  1000.0   True
2  Taylor      1   750.0  False

## Loading a CSV into a Table
You've done a great job so far at inserting data into tables! You're now going to learn how to load the contents of a CSV file into a table.

We have used the `csv module` to set up a `csv_reader`, which is just a reader object that can iterate over the lines in a given CSV file - in this case, a census CSV file. Using the `enumerate()` function, you can loop over the `csv_reader` to handle the results one at a time. Here, for example, the first line it would return is:

`0 ['Illinois', 'M', '0', '89600', '95012']`

`0` is the `idx` - or line number - while `['Illinois', 'M', '0', '89600', '95012']` is the `row`, corresponding to the column names `'state'` , `'sex'`, `'age'`, `'pop2000'` and `'pop2008'`. `'Illinois'` can be accessed with `row[0]`, `'M'` with `row[1]`, and so on. You can create a dictionary containing this information where the keys are the column names and the values are the entries in each line. Then, by appending this dictionary to a list, you can combine it with an `insert` statement to load it all into a table!

In [11]:
# Import insert from sqlalchemy
from sqlalchemy import insert
# Import csv
import csv

def load_data_census_from_csv():
    with open('../_datasets/census.csv') as csvfile:
        csv_reader = csv.reader(csvfile, delimiter=',')

        # Create a insert statement for census: stmt
        stmt = insert(census)

        # Create an empty list and zeroed row count: values_list, total_rowcount
        values_list = []
        total_rowcount = 0

        # Enumerate the rows of csv_reader
        for idx, row in enumerate(csv_reader):
            #create data and append to values_list
            data = {'state': row[0], 'sex': row[1], 'age': row[2], 'pop2000': row[3], 'pop2008': row[4]}
            values_list.append(data)

            # Check to see if divisible by 51
            if idx % 51 == 0:
                results = connection.execute(stmt, values_list)
                total_rowcount += results.rowcount
                values_list = []

    # Print total rowcount
    return (total_rowcount)

In [12]:
total_rowcount = load_data_census_from_csv()
print(total_rowcount)

8722

In [16]:
# Getting records from census where age is 70
stmt = select([census]).where(census.columns.age == 70)

df = get_df_select_stmt(connection, stmt)
df.head()

                  state sex  age  pop2000  pop2008
0              Illinois   M   70    35307    35929
1              Illinois   F   70    44539    43143
2  District of Columbia   M   70     1498     1611
3  District of Columbia   F   70     2193     2007
4            New Jersey   M   70    26370    25459

## Updating individual records
The `update` statement is very similar to an `insert` statement, except that it also typically uses a `where` clause to help us determine what data to update. You'll be using the FIPS state code using here, which is appropriated by the U.S. government to identify U.S. states and certain other associated areas. Recall that you can update all wages in the `employees` table as follows:
```phyton
stmt = update(employees).values(wage=100.00)
```
For your convenience, the names of the tables and columns of interest in this exercise are: `state_fact` (Table), `name` (Column), and `fips_state` (Column).

In [17]:
# Import create_engine
from sqlalchemy import create_engine, MetaData, select, update

# Metadata
metadata_census = MetaData()

# Create an engine that connects to the census.sqlite file: engine
engine_census = create_engine('sqlite:///census.sqlite')

# create connection
connection_census = engine_census.connect()

# Print table names
print(engine_census.table_names())

# Reflect census and state_fact table via engine_mySQL: 
state_fact = Table('state_fact', metadata, autoload=True, autoload_with=engine_census)

['census', 'state_fact']

In [18]:
# Build a select statement: select_stmt
select_stmt = select([state_fact]).where(state_fact.columns.name == "New York")

df = get_df_select_stmt(connection_census, select_stmt)
df.head()

,id,name,abbreviation,country,type,sort,status,occupied,notes,fips_state,assoc_press,standard_federal_region,census_region,census_region_name,census_division,census_division_name,circuit_court
0,32,New York,NY,USA,state,10,current,occupied,,0,N.Y.,II,1,Northeast,2,Mid-Atlantic,2

In [19]:
# Build a statement to update the fips_state to 36: stmt
stmt = update(state_fact).values(fips_state = 36)

# Append a where clause to limit it to records for New York state
stmt = stmt.where(state_fact.columns.name == "New York")

# Execute the statement: results
results = connection_census.execute(stmt)

# Print rowcount
print(results.rowcount)

1

In [20]:
# Results of executing the select_stmt
results = connection_census.execute(select_stmt).fetchall()

df = get_df_select_stmt(connection_census, select_stmt)
df.head()

,id,name,abbreviation,country,type,sort,status,occupied,notes,fips_state,assoc_press,standard_federal_region,census_region,census_region_name,census_division,census_division_name,circuit_court
0,32,New York,NY,USA,state,10,current,occupied,,36,N.Y.,II,1,Northeast,2,Mid-Atlantic,2

## Updating Multiple Records
As Jason discussed in the video, by using a `where` clause that selects more records, you can update multiple records at once. It's time now to practice this!

For your convenience, the names of the tables and columns of interest in this exercise are: `state_fact` (Table), `notes` (Column), and `census_region_name` (Column).

In [21]:
# Build a select statement: select_stmt
select_stmt = select([state_fact]).where(state_fact.columns.census_region_name == 'West')

# Results of executing the select_stmt
results = connection_census.execute(select_stmt).fetchall()

df = get_df_select_stmt(connection_census, select_stmt)
df.head()

,id,name,abbreviation,country,type,sort,status,occupied,notes,fips_state,assoc_press,standard_federal_region,census_region,census_region_name,census_division,census_division_name,circuit_court
0,37,Oregon,OR,USA,state,10,current,occupied,,41,Ore.,X,4,West,9,Pacific,9
1,3,Arizona,AZ,USA,state,10,current,occupied,,4,Ariz.,IX,4,West,8,Mountain,9
2,6,Colorado,CO,USA,state,10,current,occupied,,8,Colo.,VIII,4,West,8,Mountain,10
3,11,Hawaii,HI,USA,state,10,current,occupied,,15,Hawaii,IX,4,West,9,Pacific,9
4,26,Montana,MT,USA,state,10,current,occupied,,30,Mont.,VIII,4,West,8,Mountain,9

In [22]:
# Build a statement to update the notes to 'The Wild West': stmt
stmt = update(state_fact).values(notes='The Wild West')

# Append a where clause to match the West census region records
stmt = stmt.where(state_fact.columns.census_region_name == "West")

# Execute the statement: results
results = connection_census.execute(stmt)

# Print rowcount
print(results.rowcount)

13

In [23]:
df = get_df_select_stmt(connection_census, select_stmt)
df.head()

,id,name,abbreviation,country,type,sort,status,occupied,notes,fips_state,assoc_press,standard_federal_region,census_region,census_region_name,census_division,census_division_name,circuit_court
0,37,Oregon,OR,USA,state,10,current,occupied,The Wild West,41,Ore.,X,4,West,9,Pacific,9
1,3,Arizona,AZ,USA,state,10,current,occupied,The Wild West,4,Ariz.,IX,4,West,8,Mountain,9
2,6,Colorado,CO,USA,state,10,current,occupied,The Wild West,8,Colo.,VIII,4,West,8,Mountain,10
3,11,Hawaii,HI,USA,state,10,current,occupied,The Wild West,15,Hawaii,IX,4,West,9,Pacific,9
4,26,Montana,MT,USA,state,10,current,occupied,The Wild West,30,Mont.,VIII,4,West,8,Mountain,9

## Correlated Updates
You can also update records with data from a select statement. This is called a correlated update. It works by defining a `select` statement that returns the value you want to update the record with and assigning that as the value in an `update` statement.

You'll be using a `flat_census` in this exercise as the target of your correlated update. The `flat_census` table is a summarized copy of your census table.

```python
Build a statement to select name from state_fact: stmt
fips_stmt = select([state_fact.columns.name])

# Append a where clause to Match the fips_state to flat_census fips_code
fips_stmt = fips_stmt.where(
    state_fact.columns.fips_state == flat_census.columns.fips_code)

# Build an update statement to set the name to fips_stmt: update_stmt
update_stmt = update(flat_census).values(state_name=fips_stmt)

# Execute update_stmt: results
results = connection.execute(update_stmt)

# Print rowcount
print(results.rowcount)
```

The equivalent sql is
```sql
UPDATE flat_census SET state_name=(SELECT state_fact.name 
FROM state_fact 
WHERE state_fact.fips_state = flat_census.fips_code)
```

## Deleting all the records from a table
Often, you'll need to empty a table of all of its records so you can reload the data. You can do this with a `delete` statement with just the table as an argument. For example, in the video, Jason deleted the table `extra_employees` by executing as follows:
```Phyton
delete_stmt = delete(extra_employees)
result_proxy = connection.execute(delete_stmt)
```
Do be careful, though, as deleting cannot be undone!

In [24]:
# Print table names
print(engine.table_names())

# Reflect census and data table via engine: 
census = Table('census', metadata, autoload=True, autoload_with=engine)
data = Table('data', metadata, autoload=True, autoload_with=engine)

['census', 'data', 'employees']

In [25]:
# Import delete, select
from sqlalchemy import delete, select

# Build a statement to empty the census table: stmt
stmt = delete(census)

# Execute the statement: results
results = connection.execute(stmt)

# Print affected rowcount
print(results.rowcount)

# Build a statement to select all records from the census table
stmt = select([census])

# Print the results of executing the statement to verify there are no rows
print(connection.execute(stmt).fetchall())

8722
[]

## Deleting specific records
By using a `where()` clause, you can target the `delete` statement to remove only certain records. For example, Jason deleted all rows from the `employees` table that had id 3 with the following delete statement:
```Phyton
delete(employees).where(employees.columns.id == 3) 
```
Here you'll delete `ALL` rows which have `'M'` in the `sex` column and `36` in the `age` column. We have included code at the start which computes the total number of these rows. It is important to make sure that this is the number of rows that you actually delete.

In [26]:
total_rowcount = load_data_census_from_csv()
print(total_rowcount)

8722

In [27]:
# Import delete, select
from sqlalchemy import func, and_

# Build a statement to count records using the sex column for Men ('M') age 36: stmt
stmt = select([func.count(census.columns.sex)]).where(
    and_(census.columns.sex == 'M',
         census.columns.age == 36)
)

# Execute the select statement and use the scalar() fetch method to save the record count
to_delete = connection.execute(stmt).scalar()

# Build a statement to delete records from the census table: stmt_del
stmt_del = delete(census)

# Append a where clause to target Men ('M') age 36
stmt_del = stmt_del.where(
    and_(census.columns.sex == 'M',
         census.columns.age == 36)
)

# Execute the statement: results
results = connection.execute(stmt_del)

# Print affected rowcount and to_delete record count, make sure they match
print(results.rowcount, to_delete)

51 51

## Deleting a Table Completely
You're now going to practice dropping individual tables from a database with the `.drop()` method, as well as all tables in a database with the `.drop_all()` method!

As Spider-Man's Uncle Ben (as well as Jason, in the video!) said: With great power, comes great responsibility. Do be careful when deleting tables, as it's not simple or fast to restore large databases! Remember, you can check to see if a table exists with the `.exists()` method.

This is the final exercise in this chapter: After this, you'll be ready to apply everything you've learned to a case study in the final chapter of this course!

In [28]:
print("existe tabla census: "+ (str)(census.exists(engine)))
print("existe tabla data: "+ (str)(data.exists(engine)))

existe tabla census: True
existe tabla data: True

In [29]:
census.drop(engine)
data.drop(engine)
print(engine.table_names())

['employees']